#include <iostream>

using namespace std;

/*
    Да се състави програма чрез която се въвеждат n, 5 <= n <= 35, естествени числа от интервала [100; 990] в едномерен масив.
    Стойността на всеки от въведените елементи на масива да се закръгли към число кратно на 10. Елементите с четни индекси се закръглят
    към по-малкото число, а елементите с нечетни индекси към по-голямото число. Да се изведат началната и крайната сума на елементите.
*/

int main()
{
    int n;
    do {
        cout << "Enter n: \n";
        cin >> n;
    } while (n < 5 || n > 35);

    int arr[35];
    int sum1 = 0, sum2 = 0;
    for (int i=0; i<n; i++){
        cin >> arr[i];
        sum1 = arr[i];
        
        if (i % 2){
            arr[i] = (arr[i]/10)*10;
            sum2 += arr[i];
        }
        else {
            arr[i] = (arr[i]/10 + 1)*10;
            sum2 += arr[i];
        }
    }

    cout << "sum1 = " << sum1 << endl;
    cout << "sum2 = " << sum2 << endl;

    return 0;
}
