#include <iostream>

using namespace std;

/*
    Предварително се въвеждат n [5; 25] броя цели числа в едномерен масив и се извършва сравняване по абсолютна стойност на
    всички съседни двойки от въведените елементи. Извеждат само двойките с равни абсолютни стойности.
    Пример: n=10 184  -17 21  -21 98  -43  -43 47  -121 143
    Изход: 21, -21
        -43, -43
*/

int main()
{
    unsigned n;

    do {
        cin >> n;
    } while (n<5 || n > 25);

    int arr[25];

    for (int i=0; i<n; i++){
        cin >> arr[i];
    }

    for (int i=0; i<n-1; i++){
        if (arr[i] == arr[i+1] || arr[i] == -arr[i+1])
            cout << arr[i] << ", " << arr[i+1] << endl;
    }

    return 0;
}
